DataProcessors/РаботаСXML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>РаботаСXML</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/РеализацияТоваровИУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>РеализацияТоваровИУслуг</Name>
			<BasedOn>
				<xr:Item>Document.ЗаписьКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказыКлиентов</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаписьКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/РаботаСXML/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ВыбратьКаталог("Выбор каталога для создания базы XML ", Новый ОписаниеОповещения("ПослеВыбораКаталогаДляВыгрузки", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКаталог(ЗаголовокДиалога, Оповещение)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Заголовок = ЗаголовокДиалога;
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКаталогаДляВыгрузки(ВыбранныеФайлы, Параметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Каталог = ВыбранныеФайлы[0] + "/";
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВXMLПоследовательно(Команда)
	ИмяФайла = Каталог + Формат(ДатаВыгрузки, "ДФ=dd.MM.yy") + ".xml"; 
	
	ЗаписьXML = Новый ЗаписьXML; //1
	ЗаписьXML.ОткрытьФайл(ИмяФайла); //2
	
	ЗаписьXML.ЗаписатьОбъявлениеXML(); 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("КорневойУзел"); //3
	ЗаписьXML.ЗаписатьКомментарий("Выгрузка реализаций за дату"); //4
	ДанныеРеализации = ПолучитьДанныеОРеализацияхЗаДатуЦеликом(); //5
	
	Для ТекущаяСтрока = 0 По ДанныеРеализации.Количество() - 1 Цикл
		
		Данные = СтрРазделить(ДанныеРеализации[ТекущаяСтрока], ";");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Реализация"); //6
		ЗаписьXML.ЗаписатьАтрибут("Номер", Данные[4]); //7
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Сотрудник");
		ЗаписьXML.ЗаписатьТекст(Данные[0]);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаДокумента");
		ЗаписьXML.ЗаписатьТекст(Данные[1]);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Оплата");
		ЗаписьXML.ЗаписатьТекст(Данные[2]);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Дата");
		ЗаписьXML.ЗаписатьТекст(Данные[3]);
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента(); //8
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); //9
	ЗаписьXML.Закрыть(); //10
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка завершена!");
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеОРеализацияхЗаДатуЦеликом()  
	
	МассивДляВыгрузки = Новый Массив;
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ДатаНачала", ДатаВыгрузки); 
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаВыгрузки));
	
	Запрос.Текст=
	"ВЫБРАТЬ
	|    РеализацияТоваровИУслуг.Сотрудник.Представление КАК СотрудникПредставление,
	|    РеализацияТоваровИУслуг.ОбщаяСуммаДокументов КАК СуммаДокумента,
	|    РеализацияТоваровИУслуг.ПризнакОплаты КАК ПризнакОплаты,
	|    РеализацияТоваровИУслуг.Дата КАК Дата,
	|    РеализацияТоваровИУслуг.Номер КАК Номер
	|ИЗ
	|    Документ.РеализацияТоваровИУслуг КАК РеализацияТоваровИУслуг
	|ГДЕ
	|    РеализацияТоваровИУслуг.Проведен
	|    И РеализацияТоваровИУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|
	|УПОРЯДОЧИТЬ ПО
	|    Дата";  
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл     
		
		МассивСтроки =  Новый Массив;
		
		МассивСтроки.Добавить(Выборка.СотрудникПредставление);
		МассивСтроки.Добавить(Выборка.СуммаДокумента);
		МассивСтроки.Добавить(Выборка.ПризнакОплаты);
		МассивСтроки.Добавить(Выборка.Дата);  
		МассивСтроки.Добавить(Выборка.Номер); 
		ДанныеСтроки = СтрСоединить(МассивСтроки, ";");
		
		МассивДляВыгрузки.Добавить(ДанныеСтроки);
	КонецЦикла;
	
	возврат МассивДляВыгрузки;
	
КонецФункции 

&НаКлиенте
Процедура ПрочитатьИзXMLПоследовательно(Команда)
	ИмяФайла = Каталог + Формат(ДатаВыгрузки, "ДФ=dd.MM.yy") + ".xml";
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
	
	Пока ЧтениеXML.Прочитать() Цикл
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ЧтениеXML.Имя);
			
			Пока ЧтениеXML.ПрочитатьАтрибут() Цикл
				ТекстАтрибута = "Атрибут: " + ЧтениеXML.Имя + " = " + ЧтениеXML.Значение;
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстАтрибута);
			КонецЦикла;
			
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(ЧтениеXML.Значение);
		КонецЕсли;
		
		Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("/" + ЧтениеXML.Имя);
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЧерезDOM(Команда)
	ИмяФайла = Каталог + Формат(ДатаВыгрузки, "ДФ=dd.MM.yy") + ".xml";
	
	ЧтениеXML = Новый ЧтениеXML; //1
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
	
	Построитель = Новый ПостроительDOM; //2
	
	Документ = Построитель.Прочитать(ЧтениеXML); //3
	
	Для Каждого Элемент Из Документ.ДочерниеУзлы Цикл //4
		Если Элемент.ИмяУзла = "КорневойУзел" Тогда
			Для Каждого Элемент1 Из Элемент.ДочерниеУзлы Цикл
				Если Элемент1.ИмяУзла = "Реализация" Тогда
					Для Каждого Элемент2 Из Элемент1.ДочерниеУзлы Цикл
						Сообщить(Элемент2.ТекстовоеСодержимое + Символы.ПС);
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	ЧтениеXML.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЧерезDOMВариант2(Команда)
	ИмяФайла = Каталог + Формат(ДатаВыгрузки, "ДФ=dd.MM.yy") + ".xml";
	
	ЧтениеXML = Новый ЧтениеXML; //1
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
	
	Построитель = Новый ПостроительDOM; //2
	
	Документ = Построитель.Прочитать(ЧтениеXML); //3
	
	Сообщить(Документ.ДочерниеУзлы[0].ДочерниеУзлы[1].ДочерниеУзлы[1].ТекстовоеСодержимое);//сумма первого документа реализации
	
	ЧтениеXML.Закрыть();
	
	//	И на экран будет выведено сообщение с суммой первого документа Реализация товаров. 
	//Здесь мы через точку (это как раз и называется объектной моделью) получаем нужный нам
	//узел и выводим его значения на экран, без необходимости полного обхода дерева.
	//Второе преимущество DOM-модели: мы можем не только сразу прочитать нужный узел, 
	//но и изменить его значение, и сразу же записать. Кажется, что это очень удобно. 
	//Однако на практике ПостроительDOM в 1С используется достаточно редко. XML файлы 
	//часто встречаются достаточно большого размера, а ПостроительDOM на больших объёмах 
	//данных показывает крайне низкую производительность. Для небольших файлов же он, 
	//наоборот, работает быстрее, нежели прямой обход всех элементов.
	//Из этого можно сделать такой вывод: если у вас есть одноразовая задача считать 
	//и/или модифицировть XML документ небольшого размера — смело выбирайте вариант 
	//с DOM, это быстро и удобно. Если вы пишете унифицированный механизм, который будет 
	//работать часто и с файлами любого размера, лучше избегать использования объекта 
	//ПостроительDOM в коде.
	//	
КонецПроцедуры

&НаКлиенте
Процедура Сериализация(Команда)
	СериализацияНаСервере();
КонецПроцедуры

&НаСервере
Процедура СериализацияНаСервере()
	ИмяФайла = Каталог + Формат(ДатаВыгрузки, "ДФ=dd.MM.yy") + ".xml";
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.ОткрытьФайл(ИмяФайла);
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ТипXML = XMLТипЗнч(РеализацияТоваров); //1
	ЗаписьXML.ЗаписатьНачалоЭлемента(ТипXML.ИмяТипа, ТипXML.URIПространстваИмен); //2
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(РеализацияТоваров));//3
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Десериализация(Команда)
	ДесериализацияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДесериализацияНаСервере()
	ИмяФайла = Каталог + Формат(ДатаВыгрузки, "ДФ=dd.MM.yy") + ".xml";
	ОбъектСериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
	
	ЧтениеXML.Прочитать(); //1
	
	ТипЗначения = ИзXMLТипа(ЧтениеXML.ЛокальноеИмя, ЧтениеXML.URIПространстваИмен); //2
	ЧтениеXML.Прочитать();
	ПолученноеЗначение = XMLЗначение(ТипЗначения, ЧтениеXML.Значение); //3
	
	Сообщить(ПолученноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СериализоватьXMLЧерезXDTO(Команда)
	СериализоватьXMLЧерезXDTOНаСервере();
КонецПроцедуры

&НаСервере
Процедура СериализоватьXMLЧерезXDTOНаСервере()
	
	ИмяФайла = Каталог + Формат(ДатаВыгрузки, "ДФ=dd.MM.yy") + ".xml";
	НовыйСериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяФайла);
	
	НовыйСериализаторXDTO.ЗаписатьXML(ЗаписьXML, РеализацияТоваров);
	ЗаписьXML.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДесериализоватьXMLЧерезXDTOНаСервере(Команда)
	ДесериализоватьXMLЧерезXDTOНаСервереНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДесериализоватьXMLЧерезXDTOНаСервереНаСервере()
	
	ИмяФайла = Каталог + Формат(ДатаВыгрузки, "ДФ=dd.MM.yy") + ".xml";
	НовыйСериализаторXDTO = Новый СериализаторXDTO(ФабрикаXDTO);
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ИмяФайла);
	РеализацияСсылка = НовыйСериализаторXDTO.ПрочитатьXML(ЧтениеXML);
	Сообщить(РеализацияСсылка);
	ЧтениеXML.Закрыть();
	
КонецПроцедуры
